Revit.Elements.Views.AxonometricView
A Revit View3D

Revit.Elements.Views.AxonometricView.#ctor(Autodesk.Revit.DB.View3D)
Private constructor

Revit.Elements.Views.AxonometricView.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.BoundingBoxXYZ,System.String,System.Boolean)
Private constructor

Revit.Elements.Views.AxonometricView.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.String,Autodesk.Revit.DB.Element,System.Boolean)
Private constructor

Revit.Elements.Views.AxonometricView.InitAxonometricView(Autodesk.Revit.DB.View3D)
Initialize an AxonometricView element

Revit.Elements.Views.AxonometricView.InitAxonometricView(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.BoundingBoxXYZ,System.String,System.Boolean)
Initialize an AxonometricView element

Revit.Elements.Views.AxonometricView.InitAxonometricView(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.String,Autodesk.Revit.DB.Element,System.Boolean)
Initialize an AxonometricView element

Revit.Elements.Views.AxonometricView.ByEyePointAndTarget(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.String)
Create a Revit Axonometric (isometric) View from an eye position
and a target position.
eyePoint: A Point representing the eye point in meters.
target: A Point representing the target of view in meters.
name: The name of the view.
Returns: An AxonometricView object.

Revit.Elements.Views.AxonometricView.ByEyePointTargetAndElement(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.String,Revit.Elements.Element,System.Boolean)
Create a Revit Axonometric (isometric) View from an Eye position and target position and Element
eyePoint: A Point representing the eye point.
target: A Point representing the target of view.
element: This argument cannot be null, and it has to be either a
Revit.Elements.Element or  Revit.GeometryObjectsBoundingBox.
name: The name of the view.
isolateElement: If this argument is set to true, the element or
bounding box will be isolated in the current view by creating a minimum size
crop box around it.
Returns: An AxonometricView object.

Revit.Elements.Views.AxonometricView.ByEyePointTargetAndBoundingBox(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.BoundingBox,System.String,System.Boolean)
Create a Revit Axonometric (isometric) View from an Eye position and target position and Bounding Box
eyePoint: A Point representing the eye point.
target: A Point representing the target of view.
boundingBox: A BoundingBox. The view will be cropped to this bounding box
name: The name of the view.
isolateElement: If this argument is set to true, the element or
bounding box will be isolated in the current view by creating a minimum size
crop box around it.
Returns: An AxonometricView object.

Revit.Elements.Views.AxonometricView.FromExisting(Autodesk.Revit.DB.View3D,System.Boolean)
Create from an existing Revit Element
view:
isRevitOwned:
Returns: